package com.service;

public class MatchScoreCalculationService {


    public void isWin(){

    }


//    tie-break

//    Может разыгрываться в любом сете (при счёте геймов в сете 6:6).
//
//    Подающий игрок делает первую подачу, затем противник делает две подачи, далее смена идет через две подачи.
//    Первый, кто наберет 7 очков с разницей в 2 очка, считается выигравшим тай-брейк.
//            Тай-брейк длится столько, сколько необходимо, пока не будет достигнута разница в два очка.
//    Смена площадок происходит после каждых 6 очков.

//    set

//    Предполагает выигрыш не менее 6-ти геймов с перевесом, по крайней мере, в 2 гейма.
//    Игрок, выигравший 6 геймов, считается выигравшим сет. Если счёт в сете 6-5, то разыгрывается еще один гейм.
//    Если счёт становится 7-5, сет заканчивается. Если счёт становится 6-6, то разыгрывается тай-брейк.

}
